//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////                                                                                                       //////////
///////// Το header file της sets_util.c. Κανει include την raylib και το ADTSet μιας και θα δουλεψουμε σε Sets //////////
////////                                                                                                      ///////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#pragma once    ///include το πολυ μια φορα


#include <ADTSet.h>


Pointer set_find_eq_or_greater(Set set, Pointer value);


Pointer set_find_eq_or_smaller(Set set, Pointer value);